[
  [
    "# Substitution variables match the column names of the rules converted to camelCase. For example: Target-Trait rule column value is represented as target substitution variable in hint text.",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "# Example substitution variables:",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "#    attribute - the name of the attribute being evaluated by a rule (for example: 'wings' or 'sex')",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "#    target - the target value for the rule (for example: for the wings attribute: 'wings' or 'wingless' and for the sex attribute:  'male' or 'female')",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "#    selected - the selected value for the rule (for example: for the wings attribute: 'wings' or 'wingless' and for the sex attribute:  'male' or 'female')",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "#    incorrectParent - this value is specified in the breeding rule sheets (mom | dad | parent)",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  [
    "Priority",
    "ConceptId",
    "MinimumAttempts",
    "ProbabilityLearnedThreshold",
    "Tags",
    "Hint-1",
    "Hint-2",
    "Hint-3"
  ],
  [
    "200",
    "LG1.C2a",
    "2",
    "0.9",
    "Breeding",
    "How can you change the [incorrectParent: mom's, dad's, parent's] alleles to produce a drake that [target: is shiny, has wings, has arms, has legs, is grey, has color, is hornless, has a nose spike, has deep color]? ",
    "[target: Shiny, Wings, Arms, Legs, Grey, Color, Hornless, Nose spike, Deep color] is a dominant trait. One parent must have at least one dominant [target: shiny, wings, arms, legs, grey, color, hornless, spike, deep] allele to produce a baby that [target: is shiny, has wings, has arms, has legs, is grey, has color, is hornless, has a nose spike, has deep color].",
    "These parents cannot produce the target drake. Set at least one of [incorrectParent: the mom's, the dad's, each parent's] alleles to [target: shiny, wings, arms, legs, grey, color, hornless, spike, deep]. Sometimes it takes a while to get the target drake. Just keep breeding!"
  ],
  [
    "200",
    "LG1.C2b",
    "2",
    "0.9",
    "Breeding",
    "How can you change the [incorrectParent: mom's, dad's, parent's] alleles to produce a drake that [target: is orange, is dull, is albino, is wingless, is legless, is armless, has horns, is spikeless, has faded color, has a short tail]? ",
    "[target: Dull is, Wingless is, Armless is, Legless is, Orange is, Albino is , Horns are, Spikeless is, Faded color is, Short tails are] a recessive trait. Each parent must have at least one recessive [target: dull, wingless, armless, legless, orange, albino, horns, spikeless, faded, short] allele to produce a baby that  [target: is dull, is wingless, is armless, is legless, is orange, is albino, has horns, is spikeless, has faded color, has a short tail].",
    "These parents cannot produce the target drake. Set at least one of [incorrectParent: the mom's, the dad's, each parent's] alleles to [target: dull, wingless, armless, legless, orange, albino, horns, spikeless, faded, short tail]. Sometimes it takes a while to get the target drake. Just keep breeding!"
  ],
  [
    "200",
    "LG1.C2d",
    "2",
    "0.9",
    "Breeding",
    "Let's think only about [attribute: tails]. There are three tails alleles. Long tails are the most dominant type of tail.",
    "Kinked tails and long tails are dominant to short tails. What can you change about [incorrectParent: the mom's, the dad's, each parent's] alleles to produce a baby with a [target: long tail, kinked tail, short tail]? ",
    "To produce a baby drake that has a [target: long, kinked, short] tail, change [incorrectParent: the mom's, the dad's, each parent's] alleles and see what happens!"
  ],
  [
    "250",
    "LG1.C3",
    "2",
    "0.9",
    "Breeding",
    "Let's look only at [attribute: armor]. Sometimes alleles combine to create a trait that is inbetween a dominant and recessive trait. Change one armor allele and see what happens! ",
    "These parents can't produce a [target] baby. What can you change about [incorrectParent: the mom's, the dad's, each parent's] alleles to get [target]?",
    "Set the alleles so that your drakes can produce a [target] baby. Change [incorrectParent: the mom's, the dad's, each parent's] alleles and see what happens!"
  ],
  [
    "200",
    "LG1.C2a",
    "2",
    "0.9",
    "Hatchery",
    "This drake [target: is shiny, has wings, has arms, has legs, has horns, has a nose spike]! It only takes one [target: shiny, wings, arms, hornless, spiked] allele for a drake to [target: be shiny, have wings, have arms, be hornless, have a nose spike].",
    "",
    ""
  ],
  [
    "200",
    "LG1.C2b",
    "2",
    "0.9",
    "Hatchery",
    "This drake [target: is dull, is wingless, is armless, is legless, has horns, doesn't have a nose spike, has partial armor]! If a drake has two [target: dull, wingless, armless, horns, no spikes] alleles it will [target: be dull, be wingless, be armless, have horns, not have a nose spike].",
    "",
    ""
  ],
  [
    "250",
    "LG1.C2d",
    "2",
    "0.9",
    "Hatchery",
    "The drake has a [target]. A drake that [target: has a long tail, has a kinked tail, has a short tail] has [target: at least one long tail allele, at least one kinked tail and no long tail alleles, two short tail alleles].",
    "",
    ""
  ],
  [
    "250",
    "LG1.C3",
    "2",
    "0.9",
    "Hatchery",
    "The drake has [target]. Sometimes alleles combine to create a trait that is inbetween a dominant and recessive trait.",
    "",
    ""
  ],
  [
    "250",
    "LG1.C2c",
    "2",
    "0.9",
    "Hatchery",
    "The drake has [target]. A drake that [target: has a nose spike, has deep color] has a [target: spiked, deep] allele on the X chromosome.",
    "",
    ""
  ],
  [
    "250",
    "LG1.C2e",
    "2",
    "0.9",
    "Hatchery",
    "The drake has [target]. A drake that [target: is spikeless, has faded color] has a [target: spikeless, faded] allele on the X chromosome.",
    "",
    ""
  ],
  [
    "100",
    "LG1.A3",
    "2",
    "0.9",
    "Hatchery",
    "Wrong basket! This drake is a [target]!",
    "",
    ""
  ],
  [
    "200",
    "LG1.C2a",
    "2",
    "0.9",
    "Siblings",
    "These parents cannot produce both sibling drakes.  ",
    "[target: Shiny, Wings, Arms, Legs, Gray, Hornless] is a dominant trait. One parent must have at least one [target: shiny, wings, arms, legs, gray, hornless] allele to produce a baby that is [target: shiny, wings, arms, legs, gray, hornless].",
    "These parents cannot produce both sibling drakes. Set at least one of [incorrectParent: the mom's, the dad's, each parent's] alleles to [target: shiny, wings, arms, legs, gray, hornless] and breed again!"
  ],
  [
    "200",
    "LG1.C2b",
    "2",
    "0.9",
    "Siblings",
    "These parents cannot produce both sibling drakes.  ",
    "[target: Dull, Wingless, Armless, Legless, Orange, Horns] is a recessive trait. Each parent must have at least one [target: dull, wingless, armless, legless, orange, horns] allele to produce a baby that is [target: dull, wingless, armless, legless, orange, horns].",
    "These parents cannot produce both sibling drakes. Set at least one of [incorrectParent: the mom's, the dad's, each parent's] alleles to [target: dull, wingless, armless, legless, orange, horns] and breed again!"
  ],
  [
    "230",
    "LG1.C2c",
    "2",
    "0.9",
    "Siblings",
    "These parents cannot produce both sibling drakes. Look at the parents' [attribute: nose spike, deep color] alleles again. ",
    "[attribute: Nose spike, Deep color] is a sex-linked trait. Male drakes cannot pass their [attribute: nose spike, deep color] allele to their sons but they can pass this allele to their daughters!",
    "These parents cannot produce both sibling drakes. Change [incorrectParent: the mom's, the dad's, each parent's] [attribute: nose spike, deep color] alleles and breed again!"
  ],
  [
    "200",
    "LG1.C2d",
    "2",
    "0.9",
    "Siblings",
    "These parents cannot produce both sibling drakes. Look at the parents [attribute: tails] alleles again.",
    "[attribute: Tails] is a gene with three alleles. Long tails are the most dominant and short tails are the most recessive. Kinked tails are dominant to short tails but recessive to long tails!",
    "These parents cannot produce both sibling drakes. Change [incorrectParent: the mom's, the dad's, each parent's] [attribute: tails] alleles and breed again!"
  ],
  [
    "200",
    "LG1.C2a",
    "2",
    "0.9",
    "Sim",
    "Let's look only at [attribute: shininess, wings, arms, legs, gray and orange, color, horns, nose spikes, deep color]. What can you change to make a drake that [target: is shiny, has wings, has arms, has legs, is gray, has color, is hornless, is spiked, has deep color]? ",
    "[attribute: Shininess is, Wings are, Arms are, Legs are, Gray is, Color is, Hornless is, Nose spike is, Deep color is] a dominant trait. If a drake has at least one [target: shiny, wings, arms, legs, gray, color, hornless, spiked, deep] allele, it will [target: be shiny, have wings, have arms, have legs, be gray, have color, be hornless, have a nose spike, have deep color].",
    "Your drake [selected: is still dull, is still wingless, is still armless, is still legless, is still not gray, is still without color, has horns, is still spikeless, has faded color]! To make a drake that [target: is shiny, has wings, has arms, has legs, is gray, has color, is hornless, has a nose spike, has deep color], set one allele to [target: shiny, wings, arms, legs, gray, color, hornless, spiked, deep] and see what happens!"
  ],
  [
    "200",
    "LG1.C2b",
    "2",
    "0.9",
    "Sim",
    "Let's look only at [attribute: shininess, wings, arms, legs, gray and orange, color, horns, nose spike, deep color, tails]. What can you change to make a drake that [target: is dull, is wingless, is armless, is legless, is orange, is albino, has horns, is spikeless, has faded color, has a short tail]? ",
    "[target: Dullness is, Wingless is, Armless is, Legless is, Orange is, Albino is, Horns are, Spikeless is, Faded color is, Short tails are] a recessive trait. A drake needs two [target: dull, wingless, armless, legless, orange, albino, horns, spikeless, faded, short tail] alleles to [target: be dull, be wingless, be armless, be legless, be orange, be albino, have horns, be spikeless, have faded color, have a short tail].",
    "Your drake [selected: is shiny, has wings, has arms, has legs, is gray, has color, is hornless, has a nose spike, has deep color]! To make a drake that [target: is dull, is wingless, is armless, is legless, is orange, is albino, has horns, is spikeless, has faded color, has a short tail], set both alleles to [target: dull, wingless, armless, legless, orange, albino, horns, spikeless, faded, short tail] and see what happens!"
  ],
  [
    "250",
    "LG1.C4a",
    "1",
    "0.9",
    "Sim",
    "Let's look only at [attribute: color]. What can you change to make a drake that [target: has color, is albino]? ",
    "[attribute: Color is] a dominant trait. If a drake has at least one \"[target: color]\" allele, it will [target: have color]. Albinism is a recessive trait that eliminates the drake's color.",
    "Your drake is still the wrong color! To make a drake that has color, set one allele to color and see what happens. To make a drake that is albino, set both alleles to albino."
  ],
  [
    "250",
    "LG1.C4b",
    "1",
    "0.9",
    "Sim",
    "Let's look only at [attribute: color]. What can you change to make a drake that [target: is albino]? ",
    "[target: Albino is] a recessive trait. A drake needs two [target: albino] alleles to [target: be albino].",
    "Your drake [selected: has color]! To make a drake that [target: is albino], set both alleles to [target: albino] and see what happens!"
  ],
  [
    "200",
    "LG99.A",
    "2",
    "0.9",
    "Sim",
    "This drake [target: is already shiny, is already dull, already had wings, is already wingless, already had arms, is already armless, already had legs, is already legless, already had gray color, is already colored, already had horns, is already hornless, already had a nose spike, is already spikeless, already had deep color, is already faded, already had a short tail, already had a long tail, already had a kinked tail]. Are you sure that last move was necessary? ",
    "To earn a higher crystal, don't change unnecessary alleles! This drake [target: is already shiny, is already dull, already had wings, is  already wingless, already had arms, is already armless, already had  legs, is already legless, already had gray color, is already colored,  already had horns, is already hornless, already had a nose spike, is  already spikeless, already had deep color, is already faded, already  had a short tail, already had a long tail, already had a kinked tail].",
    "The [attribute: shininess allele was, wings allele was, arms allele was, legs allele was, gray color allele was, colored allele was, horns allele was, armor allele was, tail allele was, nose spike allele was, deep color allele was] already correct. To earn a higher crystal, don't change unnecessary alleles!"
  ],
  [
    "200",
    "LG1.C3",
    "2",
    "0.9",
    "Sim",
    "Let's look only at [attribute: armor]. Sometimes alleles combine to create a trait that is in between a dominant and recessive trait. Change one armor allele and see what happens! ",
    "Your drake still has [selected]! Look closely at the drake's back. Having no armor plates is a recessive trait and 5 armor plates is a dominant trait. What do you need to change so the drake has [target]?",
    "Set the alleles so that your drake has [target]. Drakes with 3 armor plates have one no armor allele and one full armor allele!"
  ],
  [
    "100",
    "LG1.A3",
    "2",
    "0.9",
    "Sim",
    "The drake you created is [selected] but the target drake is [target]! Hint: Look at the drake's neck!",
    "The drake you created is the wrong sex. Look at the XY chromosomes. Males have one Y and one X chromosome while females have two X chromosomes.",
    "The sex of your drake doesn't match the target drake. Change the slider from [selected] to [target]."
  ],
  [
    "200",
    "LG1.C2c",
    "2",
    "0.9",
    "Sim",
    "Let's think only about [attribute: nose spikes, deep color]. Male drakes have only one X chromosome. This one allele controls the drake's trait.",
    "[attribute: Nose spike is, Deep color is] a dominant trait. If a drake has at least one of these alleles, it will have a [attribute: nose spike, deep color].",
    "[attribute: Nose spike is, Deep color is] an X Linked trait. Change the alleles on the X chromosomes and see what happens! Remember, in male drakes, this trait is controlled by only one allele. "
  ],
  [
    "200",
    "LG1.C2e",
    "2",
    "0.9",
    "Sim",
    "Let's think only about [target: spikeless, faded color]. Male drakes have only one X chromosome. This one allele controls the drake's trait.",
    "[target: Spikeless, Faded color is] a recessive trait. If a male drake has one \"[selected: spiked, deep]\" allele, it will [selected: have a nose spike, have deep color].",
    "Your drake is still [selected: spiked, deep colored]! To make a drake that [target: is spikeless, is faded], set the alleles on the X chromosome to [target: spikeless, faded] and see what happens!"
  ],
  [
    "200",
    "LG1.C2d",
    "2",
    "0.9",
    "Sim",
    "Let's look closely at [attribute: tails]. There are three different tail alleles! ",
    "Kinked tails and long tails are dominant to short tails.",
    "Your drake still has a [selected: tail]! To make a drake that [target: has a kinked tail, has a short tail, has a long tail], set [target: both alleles to short tails, alleles so that there is at least one long tail, alleles so that there is at least one kinked tail and no long tail] and see what happens!"
  ]
]